var num; // Объявляем переменную num, но не присваиваем ей значения в данный момент
num = 5; // Присваиваем переменной num значение 5
var number = 10;// Объявляем переменную с именем number и присваиваем ей значение 10
const constant = 2; //Константа не изменяемая переменная


// типы данных
var str = "Привет мир!"; // тип данных: строка
var floot = 1.0; // тип данных: число с плавоющей точкой
var int = 2; // тип данных: челочислиное
var bool = true; // тип данных: логический правда/лож


console.log("Переменная:" + num)//Синтексис
console.log("Переменная: ", num)//Синтексис
console.log(`Переменная: ${num + number}`)//Синтексис

