var a = 5; // Объявление переменной 'a' и присваивание ей значения 5
var b = 2; // Объявление переменной 'b' и присваивание ей значения 2

var res = a - b; // Вычисление разности между 'a' и 'b' и сохранение результата в переменной 'res'
console.log('Результат вычитания:', res); // Вывод результата вычитания в консоль

console.log('Результат сложения:', a + b); // Вывод результата сложения в консоль
console.log('Результат вычитания:', a - b); // Вывод результата вычитания в консоль
console.log('Результат умножения:', a * b); // Вывод результата умножения в консоль
console.log('Результат возведения в степень:', a ** b); // Вывод результата возведения в степень в консоль
console.log('Результат деления:', a / b); // Вывод результата деления в консоль
console.log('Результат деления (целое число):', Math.floor(a / b)); // Вывод результата деления (целочисленного) в консоль
console.log('Остаток от деления:', a % b); // Вывод остатка от деления в консоль


var nam = 5; // Объявление переменной 'nam' и присваивание ей значения 5
num = nam + 5; // Присваивание переменной 'num' значения, равного сумме 'nam' и 5
num += 5; // Увеличение переменной 'num' на 5 (аналогично: num = num + 5)
num++; // Инкремент переменной 'num' (увеличение на 1)
console.log('Результат:', num); // Вывод результата в консоль


var str_1 = "12"; // Объявление переменной 'str_1' и присваивание ей значения "12"
var str_2 = "2"; // Объявление переменной 'str_2' и присваивание ей значения "2"

console.log('Результат:', (str_1 + str_2)); // Вывод конкатенации строк в консоль (результат: "122")
console.log('Результат:', Number(str_1 + str_2)); // Преобразование строки в число и вывод результата в консоль (результат: 122)


console.log('Math', Math.PI); // Вывод числа Pi в консоль
console.log('Math', Math.E); // Вывод числа e в консоль
console.log('Math', Math.min(4, 5, 1, 6, 7, 3)); // Вывод минимального значения из переданных аргументов в консоль
console.log('Math', Math.max(4, 5, 1, 6, 7, 3)); // Вывод максимального значения из переданных аргументов в консоль
